In [35]:
import pandas as pd

score_df = pd.DataFrame([[1,50,80,70,'boy',1],[2,60,45,50,'boy',2],[3,98,43,55,'boy',1],[4,70,69,89,'boy',2],[5,56,79,60,'girl',1],[6,60,68,55,'girl',2],[7,45,70,77,'girl',1],[8,55,77,76,'girl',2],[9,25,57,60,'girl',1],[10,88,40,43,'girl',3],[11,25,60,45,'boy',3],[12,80,60,23,'boy',3],[13,20,90,66,'girl',3],[14,50,50,50,'girl',3],[15,89,67,77,'girl',3]],columns=['student_id','math_score','english_score','chinese_score','sex','class'])
SCORE = score_df.set_index("student_id")


#seperate boys and girls

boys = SCORE.loc[SCORE.sex == 'boy']
girls = SCORE.loc[SCORE.sex == 'girl']
boys.mean()

math_score       63.833333
english_score    59.500000
chinese_score    55.333333
class             2.000000
dtype: float64

In [42]:
#groupby(): Split-Apply-Combine
#split data into small groups, apply functions, and combine result


SCORE.groupby('sex').mean().drop(["class"], axis = 1)

      math_score  english_score  chinese_score
sex
boy    63.833333      59.500000      55.333333
girl   54.222222      66.444444      62.666667

In [43]:
SCORE.groupby(['sex', 'class']).mean()

            math_score  english_score  chinese_score
sex  class
boy  1           74.00      61.500000      62.500000
     2           65.00      57.000000      69.500000
     3           52.50      60.000000      34.000000
girl 1           42.00      68.666667      65.666667
     2           57.50      72.500000      65.500000
     3           61.75      61.750000      59.000000

In [44]:
SCORE.groupby('sex').agg(['mean','std'])

     math_score            english_score            chinese_score             \
           mean        std          mean        std          mean        std
sex
boy   63.833333  25.222345     59.500000  14.096099     55.333333  22.491480
girl  54.222222  23.758040     66.444444  15.403823     62.666667  12.349089

         class
          mean       std
sex
boy   2.000000  0.894427
girl  2.111111  0.927961

In [46]:
SCORE.groupby(['sex', 'class']).agg(['mean', 'max'])

           math_score     english_score     chinese_score
                 mean max          mean max          mean max
sex  class
boy  1          74.00  98     61.500000  80     62.500000  70
     2          65.00  70     57.000000  69     69.500000  89
     3          52.50  80     60.000000  60     34.000000  45
girl 1          42.00  56     68.666667  79     65.666667  77
     2          57.50  60     72.500000  77     65.500000  76
     3          61.75  89     61.750000  90     59.000000  77

題目 : 運用下列分數資料分析 
    
Q1:找出全年級各科成績最高分與最低分？
    
Q2:找出數學班平均最高的班級？
    
Q3:分析全校女生與男生國文平均差幾分？

score_df = pd.DataFrame([[1,50,80,70,'boy',1],[2,60,45,50,'boy',2],[3,98,43,55,'boy',1],[4,70,69,89,'boy',2],[5,56,79,60,'girl',1],[6,60,68,55,'girl',2],[7,45,70,77,'girl',1],[8,55,77,76,'girl',2],[9,25,57,60,'girl',1],[10,88,40,43,'girl',3],[11,25,60,45,'boy',3],[12,80,60,23,'boy',3],[13,20,90,66,'girl',3],[14,50,50,50,'girl',3],[15,89,67,77,'girl',3]],columns=['student_id','math_score','english_score','chinese_score','sex','class'])

In [61]:
#Q1

def score_max_min(df):
    print('max score is %d' %df.max())
    print('min score is %d' %df.min())

score_max_min(SCORE.math_score)
score_max_min(SCORE.chinese_score)
score_max_min(SCORE.english_score)

max score is 98
min score is 20
max score is 89
min score is 23
max score is 90
min score is 40

In [76]:
#Q2

SCORE.groupby('class').mean().math_score.max() #class 2

61.25

In [106]:
#Q3

SCORE.groupby(['sex'], as_index = True).mean()

62.66667 - 55.33333

7.333340000000007